{
  "sectionTitle": "DLT QA — ускорение баг-репортов",
  "sectionDesc": "Чек-листы для контроля качества браузерного инструмента, который сокращает оформление баг-репорта с ~20–30 минут до ~5–10 минут.",
  "items": [
    {
      "title": "Smoke для браузерного расширения (Chromium)",
      "status": "done",
      "summary": "Проверяю, что продукт запускается, основные кнопки и экраны работают, сценарий «пользователь сделал действие → получил результат» проходит без блокеров. Описание намеренно краткое, проект в активной разработке.",
      "checks": [
        "Расширение устанавливается в Chromium без ошибок и появляется в панели",
        "Popup открывается по клику на иконку, все элементы отображаются",
        "Кнопка «Новый репорт» создаёт пустую форму с нужными полями",
        "Автозаполнение окружения (браузер, ОС, разрешение) срабатывает корректно",
        "Заполненный репорт сохраняется / копируется без потери данных",
        "Повторное открытие popup после сохранения — предыдущий репорт не «застревает»"
      ]
    },
    {
      "title": "Совместимость (Chrome/Edge, разные разрешения)",
      "status": "in-progress",
      "summary": "Быстро проверяю, что интерфейс расширения и ключевые функции одинаково ведут себя в популярных браузерах и на разных размерах экрана, без «съехавшей» верстки и сломанной логики.",
      "checks": [
        "Расширение работает в Chrome (последняя стабильная версия)",
        "Расширение работает в Edge (Chromium-based)",
        "Popup корректно отображается на 1920×1080, 1366×768 и 1280×720",
        "Шрифты и иконки не обрезаются при масштабе 100% и 125%",
        "Кнопки и формы остаются доступными при узкой ширине popup"
      ]
    },
    {
      "title": "Обработка ошибок и нестандартных ситуаций",
      "status": "in-progress",
      "summary": "Проверяю реакцию на сбои сети, медленную загрузку, неожиданные переходы, отсутствие нужных элементов и другие частые жизненные проблемы, не ломая работу пользователя.",
      "checks": [
        "При отсутствии сети расширение показывает понятное сообщение, а не падает",
        "При медленном ответе сервера отображается индикатор загрузки",
        "Закрытие popup во время заполнения не теряет введённые данные",
        "Пустая отправка формы блокируется с валидацией обязательных полей",
        "Переход на другую вкладку и возврат не ломает состояние расширения"
      ]
    },
    {
      "title": "Приватность и чувствительные данные",
      "status": "in-review",
      "summary": "Проверяю, что продукт не сохраняет и не показывает лишнее: скрывает чувствительные поля, не тащит персональные данные по умолчанию и ведёт себя безопасно.",
      "checks": [
        "Расширение не запрашивает избыточные разрешения при установке",
        "Чувствительные поля (пароли, токены) не попадают в собираемые данные",
        "Скриншот не захватывает элементы, помеченные как sensitive",
        "Локальное хранилище не содержит данных после очистки пользователем",
        "Данные не отправляются на внешние серверы без явного действия пользователя"
      ]
    },
    {
      "title": "Пошаговый режим (инструкции на экране)",
      "status": "in-progress",
      "summary": "Проверяю, что подсказки появляются вовремя, шаги не путаются, пользователь может двигаться вперёд/назад, а при ошибке получает понятное сообщение и может продолжить сценарий.",
      "checks": [
        "Первый шаг отображается сразу после запуска пошагового режима",
        "Кнопки «Далее» / «Назад» корректно переключают шаги",
        "Индикатор прогресса (1 из N) соответствует текущему шагу",
        "Пропуск необязательного шага не ломает последовательность",
        "При ошибке на шаге пользователь видит сообщение и может повторить или пропустить",
        "Завершение всех шагов формирует итоговый репорт"
      ]
    }
  ]
}
