{
  "sectionTitle": "DLT QA — Чек-листы",
  "sectionDesc": "Контрольные списки для браузерного инструмента ускорения баг-репортов",
  "items": [
    {
      "title": "DLT QA — Прогресс проекта",
      "status": "done",
      "summary": "Отслеживаем ключевые этапы подготовки: от идеи до готовых артефактов тестирования. Этот чек-лист отражает, что уже сделано на уровне планирования и организации проекта.",
      "checks": [
        "Идея сформулирована: измеримая цель — сократить баг-репорт с ~20–30 минут до ~5–10 минут",
        "Продумана структура баг-репорта: шаги, окружение, доказательства, expected / actual",
        "Сформирован UX-поток быстрого создания репорта — без лишних действий пользователя",
        "Подготовлены контрольные чек-листы качества: smoke, совместимость, ошибки, приватность",
        "Подготовлены тест-планы уровня релиза без раскрытия внутренней реализации"
      ]
    },
    {
      "title": "DLT QA — Совместимость",
      "status": "in-progress",
      "summary": "Проверка корректности интерфейса и базовых сценариев в разных браузерах и при разных разрешениях экрана.",
      "checks": [
        "UI не ломается в Chrome и Edge при стандартных сценариях",
        "Попап / панель открывается корректно в обоих браузерах",
        "Верстка не съезжает при разных разрешениях экрана",
        "Все кнопки и поля формы доступны для взаимодействия",
        "Базовые сценарии работы расширения не содержат блокеров"
      ]
    },
    {
      "title": "DLT QA — Приватность и чувствительные данные",
      "status": "in-progress",
      "summary": "Проверяем, что инструмент собирает минимум данных и не передаёт их без явного действия пользователя.",
      "checks": [
        "Расширение не хранит данные, выходящие за рамки задачи",
        "Чувствительные поля не попадают в собираемые данные",
        "Данные не отправляются на внешние сервисы без явного действия пользователя",
        "Применён принцип минимизации: собирается только то, что нужно для работы"
      ]
    },
    {
      "title": "DLT QA — Ошибки и нестандартные ситуации",
      "status": "in-progress",
      "summary": "Проверяем устойчивость инструмента при сбоях сети, медленной загрузке и нестандартных переходах.",
      "checks": [
        "Сценарий не падает при отсутствии сети — показывается понятное сообщение",
        "Медленная загрузка не блокирует интерфейс",
        "Нужный элемент страницы не найден — расширение обрабатывает без краша",
        "Переходы между страницами не ломают состояние",
        "Обновление страницы не теряет частично заполненные данные",
        "Сценарий не падает и не теряет состояние при нестандартных действиях"
      ]
    }
  ]
}
